{"data":{"markdownRemark":{"html":"<p><img src=\"https://cdn-images-1.medium.com/max/1000/1*xuV8uBeC-J3GiCC5nnYc-A.png\" alt=\"alt-text\" title=\"Facebook dark\"></p>\n<p>If you use Facebook, you’ve probably noticed that, depending on who you’re friends with, there are almost no personal posts anymore.</p>\n<h2>Shot By Brands</h2>\n<p>Where are the babies' pictures? That friend who passed his driving test? That girl you saw earlier on the bus?</p>\n<blockquote>\n<p>Now it’s just marketing and advertising and clickbait, with almost no interest or quality.</p>\n</blockquote>\n<h3>Facebook News Feed is becoming more professional and less personal.</h3>\n<p>People are leaving to social networks that are most intimate like Instagram (owned by Facebook), Snapchat and even Medium.</p>\n<h2>Killed by Old People.</h2>\n<p>Your Boss is there, your parents are there, and probably your grandparents are there.\n<br></p>\n<blockquote>\n<p>An estimated 56% of adults over 65 years old that uses the internet has a Facebook account. (Study done in 2014)\nI don’t mean that people from older generations don’t deserve to be part of a social network, everybody deserves it.</p>\n</blockquote>\n<h3>But what they post it’s not what the younger generations want to see.</h3>\n<p>And that’s why we are leaving.</p>\n<h2>Buried by Quantity.</h2>\n<p>With approximately 1.8 billion monthly active users, Facebook quality is decreasing at a fast rate, as those who kept the quality bar high are leaving to other social networks.</p>\n<p>With the changes in the algorithm of Facebook, the interesting pages that we follow, are getting in the shadow of those who pay for ads. So, the more pages that pay, the less we’ll see in our feed the ones we really want to see.</p>\n<h2>The truth is Mark Zuckerberg created a social network that changed people’s life and that will always remain in our hearts.</h2>","frontmatter":{"date":"February 03, 2017","path":"/blog/facebook-is-dying","title":"Facebook is Dying"}}},"pageContext":{}}