{"data":{"markdownRemark":{"html":"<p><img src=\"https://cdn-images-1.medium.com/max/1000/1*VVF_nzCqYJcKC3M5Vc4IPw.png\"></p>\n<h2>Google’s SDK is here, and it has a word to say in Mobile App development.</h2>\n<p>At first sight, this may seem the name of some kind of butterfly, but it is\n<strong>Google’s new framework for building high-quality native apps</strong> for iOS and\nAndroid. If you’re a Mobile Developer, you should take a look at it as it’s\ngoing to change the way native apps are developed.</p>\n<h3>Code once, run anywhere</h3>\n<p>With Flutter, you can code one time and run the same app for iOS and Android\ndevices, and it’ll automatically adapt to each operative system.</p>\n<p>You’re probably thinking <em>“What if I want to have different stuff on each\ndevice?”.</em> — You can! Flutter gives you the possibility to adapt the code and UI\nof the app depending on which devices are being run.</p>\n<code>\n<pre>\ntheme: new ThemeData(\n<pre><code>primaryColor:\n</code></pre>\n<p>   Theme.of(context).platform == Target.Platform.iOS\n? Colors.grey[100]\n: Colors.blue</p>\n<p>)</p>\n</pre>\n</code>\n<p>The above code changes the theme color to grey if the device used is running iOS\nand blue if it’s an Android device.</p>\n<hr>\n<h3>The Usain Bolt Of Mobile App Development</h3>\n<p>Everything is fast when using Flutter, from code writing to compiling.</p>\n<p>If you want to build an app as fast as possible without much complication you’ve\nfound your way.</p>\n<div class=\"newline-paragraph\"></div>\n<h4>UI Code</h4>\n<p>The simplicity remains in how you only need one language for the whole app.\nForget a huge load of files created when developing using Android Native.</p>\n<blockquote>\n<p>Flutter’s widget is written in Dart language. Same file without having to keep\nswitching files to modify the UI with its functionality.</p>\n</blockquote>\n<p>The downside is the <strong>deeply nested code</strong> that you’ll need to write and edit\nwhen using Flutter.</p>\n<p>Moreover, when I say deeply nested code,  <em>I really mean it</em>! Imagine all the\nconditionals, transformations, iterations, state reading, event handlers and the\nUI in the same functions.</p>\n<p><em>I know, right?</em></p>\n<p>This makes it <strong>unusable when you start</strong> working with it but gets easier as you\nstart using it.</p>\n<div class=\"newline-paragraph\"></div>\n<h4>Hot Reload</h4>\n<p>Besides that, Flutter has the fantastic <strong>Hot Reload</strong> feature that is a fast\nDart Compiler technology that allows you to load code changes into a running app\nwithout losing its actual state. The changes are applied <strong>instantly</strong> in the\nrunning app.</p>\n<hr>\n<h3>It’s not just fun and games</h3>\n<p>Flutter Beta 2 was announced in April 2018, and there is no stable version yet.\nWhich means that there’ll be changes and improvements that may demand changes on\nyour code.</p>\n<p>Yes, it’s true that Google’s support to Flutter is impressive but,<br>  despite\nthis fact, the amount of libraries available to be used with Flutter is still\nlow. It would be very time-consuming for the developers to build the necessary\nlibraries, which ultimately kills the primary purpose of Flutter.</p>\n<p>However there’s more…</p>\n<div class=\"newline-paragraph\"></div>\n<h4>Dart…</h4>\n<p>To develop Flutter apps, you’ll need to learn Dart or hire a Dart developer.\nIt’s really not a hard thing to learn, and if you’re a developer you might like\nto learn as many languages as possible, but maybe you’ll lose some time trying\nto get used to it.</p>\n<hr>\n<h3>Is it worth it?</h3>\n<p>Flutter is fun and fast to code a well-designed app. Still has much room to\nimprove to become a real opponent to Android Native.</p>\n<p>For a reasonably modern framework, Flutter has progressed remarkably quick and,\nsurely it will have a word to say in the future for the Mobile App development.</p>\n<p><em>Is it ready to be applied to big scale apps?</em> Likely not, but I’m expecting\nafter these things are fixed, <strong>we can all enjoy Flutter!</strong></p>\n<blockquote>\n<p>Well, folks, that is all for now!</p>\n</blockquote>\n<hr>\n<p>This Blog Post was written in my internship at <a href=\"https://picuscreative.com/\">PICUS</a>.</p>\n<p><a href=\"https://www.facebook.com/picuscreative/\">Facebook</a><em>,</em><a href=\"https://www.instagram.com/picuscreative/\">\nInstagram</a><em>,</em><a href=\"https://www.linkedin.com/company/picuscreative\">\nLinkedIn</a><em>, and</em><a href=\"https://twitter.com/picuscreative\">\nTwitter</a><em>.</em></p>\n<p><strong>Flutter Links:</strong></p>\n<ul>\n<li><a href=\"https://medium.com/tag/mobile-app-development?source=post\">Mobile App\nDevelopment</a></li>\n<li><a href=\"https://medium.com/tag/flutter?source=post\">Flutter</a></li>\n<li><a href=\"https://medium.com/tag/google?source=post\">Google</a></li>\n<li><a href=\"https://medium.com/tag/software-development?source=post\">Software Development</a></li>\n<li><a href=\"https://medium.com/tag/software?source=post\">Software</a></li>\n</ul>","frontmatter":{"date":"August 21, 2018","path":"/blog/flutter-reasons-why-you-will-fall-in-love-with-it","title":"Flutter — Reasons Why You Will Fall In Love With It"}}},"pageContext":{}}