{"data":{"markdownRemark":{"html":"<h2>Open Internet may be at risk of extinction.</h2>\n<p><img src=\"https://cdn-images-1.medium.com/max/1000/1*1Sp40V-pe4gW1tdSfs1gDA.jpeg\"></p>\n<p>Net neutrality is the idea that Internet service providers (ISPs) and\ngovernments should treat all data on the Internet the same, not charging\nanything depending on the content, treating all websites and services the same.</p>\n<h4>You can use it has much as you want, for anything you want.</h4>\n<p>Net Neutrality has made the internet a giant space of free speech and\ninnovation. It gives all individuals and companies the same opportunity to find\nan audience to whom share their ideas.</p>\n<h3>What If They Kill Net Neutrality?</h3>\n<p>At the moment, all your data goes through a single connection and you pay a\nmonthly fee.</p>\n<p>But what if ISPs started to charge you depending on what you’re trying to access\nand do with your connection?</p>\n<p><strong>With the end of net neutrality ISPs would be able to block websites and charge\nsubscribers an additional fee to access them, or even charge directly to\nwebsites to deliver their content to customers faster.</strong></p>\n<blockquote>\n<p>This means that small businesses that cannot afford to reach users at faster\nspeeds would be relegated to the background, because no one wants a slow\nwebsite.</p>\n</blockquote>\n<h3>The End is Near</h3>\n<p>In 2015, the Federal Communications Commission’s (FCC) chairman, Tom Wheeler\n<strong>passed the Open Internet Order to benefit net neutrality</strong>, after decades of\nwork to impose it.</p>\n<blockquote>\n<p>In the next weeks, the President of USA will choose a new chairman of the FCC\nthat will be able to reverse all the orders made by previous commissioners.</p>\n</blockquote>\n<p><img src=\"https://cdn-images-1.medium.com/max/1000/1*owjckPt0gi-VbapeMecySQ.jpeg\"></p>\n<p>It’s not obvious what is the opinion of Trump about this topic, but <strong>based on\nhis tweet saying that net neutrality is just a way of attacking conservative\nmedia, and the relationship of Trump with modern types of media</strong>, we can almost\ncertainly say that he’s not very much in favor of it.</p>\n<h3>The future of Open Internet is in danger.</h3>","frontmatter":{"date":"February 05, 2017","path":"/blog/net-neutrality-danger-you-should-care","title":"Net Neutrality is in Danger and You Should Care About It"}}},"pageContext":{}}